# Homebrew
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
brew "brew-cask-completion"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font-mono"
cask "font-mononoki-nerd-font"
cask "font-mononoki-nerd-font-mono"

# Terminal
cask "iterm2"

# Shell
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "zsh"
brew "zsh-completions"

# GNU Tools
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "grep"

# Docker / Kubernetes
cask "docker"
brew "docker-completion"
brew "docker-compose-completion"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kustomize"
cask "minikube"

# Browsers
cask "firefox"
cask "google-chrome"
cask "brave-browser"


# Source Control & Editors
brew "git"
brew "vim"
cask "visual-studio-code"

# CLI Tools
brew "fzf"
brew "archey"
brew "fortune"
brew "bat"
brew "glances"
brew "htop"
brew "nmap"
brew "prettyping"
brew "tree"
brew "watch"
brew "wget"
brew "cheat"
brew "tldr"
brew "speedtest-cli"

# Apps
cask "appcleaner"
cask "keepingyouawake"
cask "1password-beta"
cask "1password-cli"
cask "spotify"
cask "slack"
cask "google-backup-and-sync"
cask "nordvpn"
cask "transmission"
cask "vlc"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "zoomus"
