# Homebrew Bundle

## Taps
tap "txn2/tap"

## Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"

## Terminal Emulators
cask "iterm2"

## Shell
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "zsh"
brew "zsh-completions"
brew "shellcheck"

## GNU Tools
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "gzip"
brew "less"
brew "make"
brew "screen"

## CLI Tools
brew "tmux"
brew "fzf"
brew "archey4"
brew "cowsay"
brew "fortune"
brew "lolcat"
brew "nyancat"
brew "bat"
brew "glances"
brew "htop"
brew "prettyping"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"
brew "pstree"
brew "jq"
brew "yq"
brew "tldr"
#brew "speedtest-cli"

## DevOps

### Source Control & Code Editors
brew "git"
brew "git-filter-repo"
brew "vim"
cask "visual-studio-code"
#cask "goland"

# Programming Languages
brew "python3"
brew "go"

### Network Monitoring
brew "netcat"
brew "nmap"
cask "wireshark"

### Docker / Kubernetes
cask "docker"
brew "kubernetes-cli"
brew "txn2/tap/kubefwd"
brew "krew"
brew "k9s"
#brew "minikube"
#brew "kind"
brew "helm"

# CFSSL
#brew "cfssl"

### Terraform / OpenTofu
#brew "terraform"
brew "opentofu"
brew "tflint"

### Cloud Providers
brew "awscli"


## Applications

### Browsers
#cask "firefox"
cask "google-chrome"

### Apps
cask "appcleaner"
cask "keepingyouawake"
cask "keyboardcleantool"
#cask "rectangle"
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "spotify"
cask "slack"
cask "telegram"
cask "zoom"
#cask "discord"
#cask "google-drive"
#cask "nordvpn"
cask "transmission"
cask "vlc"
